АлогистикТест2/src/InformationRegisters/алк_ФактическиеПоказателиПроизводства/алк_ФактическиеПоказателиПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ФактическиеПоказателиПроизводства</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов</name>
  <attributes>
    <name>ВременнаяМетка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперацияПроизводства</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.алк_ВидЗначенияПоказателяОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидЗначенияПоказателяОтчетов/алк_ВидЗначенияПоказателяОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидЗначенияПоказателяОтчетов</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/InformationRegisters/алк_ФактическиеПоказателиПроизводства/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); 
	СписокОпераций = ЭтотОбъект.Выгрузить(,"Показатель").ВыгрузитьКолонку("Показатель");

	#Если НаКлиенте и Не НаКлиенте тогда
	СписокОпераций = новый Соответствие;	
	#КонецЕсли
	Для каждого ЗаписьНабора из ЭтотОбъект Цикл
		Если ЗаписьНабора.Период = НачалоМесяца(ЗаписьНабора.Период) тогда
			НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();
	    	НоваяЗапись.ПериодРасчета = ЗаписьНабора.Период; 
			НоваяЗапись.ВидЗначения = Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт;
	   		НоваяЗапись.ОперацияПроизводства = ЗаписьНабора.Показатель;
			НоваяЗапись.ВременнаяМетка = ТекущаяДата();
			НоваяЗапись.Записать(Истина); 
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры       


Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	МассивПоказателейДоЗаписи = новый массив;
	ОтборРегистратор = ЭтотОбъект.Отбор.Найти("Регистратор");
	Если ОтборРегистратор <> Неопределено тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	МИНИМУМ(алк_ФактическиеПоказателиПроизводства.Период) КАК ПериодРасчета,
		|	алк_ФактическиеПоказателиПроизводства.Показатель КАК ОперацияПроизводства,
		|	&ТекущаяДата КАК ВременнаяМетка
		|ИЗ
		|	РегистрСведений.алк_ФактическиеПоказателиПроизводства КАК алк_ФактическиеПоказателиПроизводства
		|ГДЕ
		|	алк_ФактическиеПоказателиПроизводства.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ФактическиеПоказателиПроизводства.Показатель");
		Запрос.УстановитьПараметр("Регистратор", 	ОтборРегистратор.Значение);
		Запрос.УстановитьПараметр("ТекущаяДата", 	ТекущаяДата()); 
		РезультатЗапрос = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапрос.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.СоздатьМенеджерЗаписи();  
			ЗаполнитьЗначенияСвойств(НоваяЗапись, РезультатЗапрос); 
			НоваяЗапись.ВидЗначения = Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт; 
			НоваяЗапись.Записать(Истина);	
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры
